# Getting started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

'C:\\Users\\MRossol\\Dropbox\\Python\\pydata-book'

## Introduction to pandas data structures

### Series

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
Int64Index([0, 1, 2, 3], dtype='int64')

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
obj2['a']

In [9]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [11]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [17]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [18]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [19]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [22]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [23]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [24]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [25]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [26]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [27]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [28]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [29]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [32]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [34]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [35]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [36]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [37]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [39]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [40]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [41]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [42]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [43]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [44]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [45]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [46]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [47]:
index[1:]

Index(['b', 'c'], dtype='object')

In [48]:
index[1] = 'd'

TypeError: Indexes does not support mutable operations

In [49]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [50]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [51]:
'Ohio' in frame3.columns

True

In [52]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [53]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [54]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [56]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [57]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [58]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [59]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [60]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [61]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### Dropping entries from an axis

In [63]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [64]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [65]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [66]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [68]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [69]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [70]:
obj[1]

1.0

In [71]:
obj[2:4]

c    2
d    3
dtype: float64

In [72]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [73]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [74]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [75]:
obj['b':'c']

b    1
c    2
dtype: float64

In [76]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [77]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [79]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [80]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [81]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [82]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [83]:
data[data < 5] = 0

In [84]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [86]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [87]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [88]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [89]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [90]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [91]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [92]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [93]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [94]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [95]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [96]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

#### Arithmetic methods with fill values

In [97]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [98]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [99]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [100]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [101]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

#### Operations between DataFrame and Series

In [102]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [103]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [104]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [105]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [106]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [107]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [108]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [109]:
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [110]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [111]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### Function application and mapping

In [113]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [114]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [115]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [116]:
f = lambda x: x.max() - x.min()

In [117]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [118]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [119]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [120]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [121]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [122]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [123]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [124]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [125]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [127]:
obj = Series([4, 7, -3, 2])
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [128]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [129]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [130]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [131]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [132]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [133]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [134]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [135]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [137]:
frame.rank()

     a  b  c
0  1.5  3  2
1  3.5  4  3
2  1.5  1  4
3  3.5  2  1

In [138]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### Axis indexes with duplicate values

In [139]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [140]:
obj.index.is_unique

False

In [141]:
obj['a']

a    0
a    1
dtype: int32

In [142]:
obj['c']

4

In [143]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [144]:
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [145]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [146]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [147]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [148]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [149]:
df.idxmax()

one    b
two    d
dtype: object

In [150]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [151]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [152]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [155]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [158]:
price[:5]

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [159]:
volume[:5]

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [156]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-13 -0.003068 -0.010113 -0.003694 -0.003327
2016-10-14  0.005556  0.000437  0.004749  0.008784
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255

In [160]:
returns.MSFT.corr(returns.IBM)

0.5028889680899109

In [161]:
returns.MSFT.cov(returns.IBM)

8.9123635347853478e-05

In [162]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407956  0.386780  0.391105
GOOG  0.407956  1.000000  0.405373  0.466725
IBM   0.386780  0.405373  1.000000  0.502889
MSFT  0.391105  0.466725  0.502889  1.000000

In [163]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000108  0.000078  0.000095
GOOG  0.000108  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000147  0.000089
MSFT  0.000095  0.000108  0.000089  0.000214

In [164]:
returns.corrwith(returns.IBM)

AAPL    0.386780
GOOG    0.405373
IBM     1.000000
MSFT    0.502889
dtype: float64

In [165]:
returns.corrwith(volume)

AAPL   -0.075904
GOOG   -0.007175
IBM    -0.205010
MSFT   -0.095487
dtype: float64

### Unique values, value counts, and membership

In [166]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [167]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [168]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [169]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
a    3
b    2
dtype: int64

In [170]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [171]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [172]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [173]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## Handling missing data

In [174]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [175]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [176]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [177]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [178]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [179]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [180]:
cleaned

   0    1  2
0  1  6.5  3

In [181]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [182]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [183]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [184]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [185]:
df.dropna(thresh=3)

          0         1         2
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data

In [186]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [187]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [188]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [189]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185       NaN       NaN
5  0.862580       NaN       NaN

In [190]:
df.fillna(method='ffill')

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185  1.349742 -1.549106
5  0.862580  1.349742 -1.549106

In [191]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185       NaN -1.549106
5  0.862580       NaN -1.549106

In [192]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [193]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [194]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [195]:
data['b']

1   -0.023493
2   -2.304234
3   -0.652469
dtype: float64

In [196]:
data['b':'c']

b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
dtype: float64

In [197]:
data.ix[['b', 'd']]

b  1   -0.023493
   2   -2.304234
   3   -0.652469
d  2    1.074623
   3    0.723642
dtype: float64

In [198]:
data[:, 2]

a    0.852965
b   -2.304234
c   -1.332610
d    1.074623
dtype: float64

In [199]:
data.unstack()

          1         2         3
a  0.670216  0.852965 -0.955869
b -0.023493 -2.304234 -0.652469
c -1.218302 -1.332610       NaN
d       NaN  1.074623  0.723642

In [200]:
data.unstack().stack()

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [201]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [202]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [203]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [204]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [205]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [206]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [207]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [208]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [209]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [210]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [211]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [212]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [213]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [214]:
ser

0    0
1    1
2    2
dtype: float64

In [215]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [216]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [217]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [218]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

### Panel data

In [219]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [220]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1732 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-10-19 00:00:00
Minor_axis axis: Open to Adj Close

In [221]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   27.990226  14.06528  313.062468  25.884104
2010-01-05   28.038618  14.38450  311.683844  25.892466
2010-01-06   27.592626  14.10397  303.826685  25.733566
2010-01-07   27.541619  14.23940  296.753749  25.465944
2010-01-08   27.724725  14.36516  300.709808  25.641571
2010-01-11   27.480148  14.37483  300.255255  25.315406
2010-01-12   27.167562  14.56830  294.945572  25.148142
2010-01-13   27.550775  14.57797  293.252243  25.382312
2010-01-14   27.391211  14.22005  294.630868  25.892466
2010-01-15   26.933449  13.92985  289.710772  25.808835
2010-01-19   28.124939  14.32646  293.516976  26.009552
2010-01-20   27.692027  14.03626  289.915587  25.583028
2010-01-21   27.213337  13.92017  291.199286  25.097963
2010-01-22   25.863592  13.18982  274.730736  24.219826
2010-01-25   26.559391  13.43650  269.730740  24.520902
2010-01-26   26.934757  13.13662  270.939526  24.671439
2010-01-27   27.188489  13.08825  270.779695  24.813614
2010-01-28   26.065007  12.84641  266.878565  24.387091
2010-01-29   25.119401  12.47882  264.705742  23.567497
2010-02-01   25.468608  12.78837  266.244198  23.759851
2010-02-02   25.616400  12.86576  265.295156  23.801666
2010-02-03   26.057159  12.92380  270.140309  23.943840
2010-02-04   25.118093  12.58523  263.127321  23.283148
2010-02-05   25.564084  12.80772  265.380075  23.433686
2010-02-08   25.388826  12.95282  266.468996  23.182789
2010-02-09   25.659561  13.10760  267.952522  23.425323
2010-02-10   25.519617  13.30107  266.958496  23.408596
2010-02-11   25.983917  13.49454  267.932539  23.517319
2010-02-12   26.207567  13.38813  266.294170  23.358417
2010-02-16   26.602551  13.67834  270.380071  23.820544
...                ...       ...         ...        ...
2016-09-08  105.519997       NaN  775.320007  57.430000
2016-09-09  103.129997       NaN  759.659973  56.209999
2016-09-12  105.440002       NaN  769.020020  57.049999
2016-09-13  107.949997       NaN  759.690002  56.529999
2016-09-14  111.769997       NaN  762.489990  56.259998
2016-09-15  115.570000       NaN  771.760010  57.189999
2016-09-16  114.919998       NaN  768.880005  57.250000
2016-09-19  113.580002       NaN  765.700012  56.930000
2016-09-20  113.570000       NaN  771.409973  56.810001
2016-09-21  113.550003       NaN  776.219971  57.759998
2016-09-22  114.620003       NaN  787.210022  57.820000
2016-09-23  112.709999       NaN  786.900024  57.430000
2016-09-26  112.879997       NaN  774.210022  56.900002
2016-09-27  113.089996       NaN  783.010010  57.950001
2016-09-28  113.949997       NaN  781.559998  58.029999
2016-09-29  112.180000       NaN  775.010010  57.400002
2016-09-30  113.050003       NaN  777.289978  57.599998
2016-10-03  112.519997       NaN  772.559998  57.419998
2016-10-04  113.000000       NaN  776.429993  57.240002
2016-10-05  113.050003       NaN  776.469971  57.639999
2016-10-06  113.889999       NaN  776.859985  57.740002
2016-10-07  114.059998       NaN  775.080017  57.799999
2016-10-10  116.050003       NaN  785.940002  58.040001
2016-10-11  116.300003       NaN  783.070007  57.189999
2016-10-12  117.339996       NaN  786.140015  57.110001
2016-10-13  116.980003       NaN  778.190002  56.919998
2016-10-14  117.629997       NaN  778.530029  57.419998
2016-10-17  117.550003       NaN  779.960022  57.220001
2016-10-18  117.470001       NaN  795.260010  57.660000
2016-10-19  117.120003       NaN  801.500000  57.529999

[1732 rows x 4 columns]

In [222]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900   73.371509
DELL   12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300   25.262972

In [223]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   72.845742  14.58765  300.100412  26.426222
2012-05-23   74.623162  12.08221  304.426106  25.849037
2012-05-24   73.937831  12.04351  301.528978  25.813517
2012-05-25   73.541536  12.05319  295.470050  25.804637
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   74.846812  12.24666  296.873645  26.248626
2012-05-30   75.749262  12.14992  293.821674  26.053272
2012-05-31   75.560928  11.92743  290.140354  25.920075
2012-06-01   73.371509  11.67592  285.205295  25.262972
2012-06-04   73.803114  11.60821  289.006480  25.351768
2012-06-05   73.612167  11.76298  284.920579  25.316250
2012-06-06   74.740879  11.81619  289.995487  26.062152
2012-06-07   74.774881  11.73396  288.826666  25.955594
2012-06-08   75.899667  11.72429  289.935570  26.328544
2012-06-11   74.702944  11.47278  283.966519  25.662561
2012-06-12   75.355585  11.57919  282.268201  26.008873
2012-06-13   74.832430  11.87423  280.265216  25.866795
2012-06-14   74.750029  11.93711  279.246220  26.053272
2012-06-15   75.090082  11.89841  281.973510  26.657097
2012-06-18   76.613776  12.01449  285.140358  26.497261
2012-06-19   76.826969  11.78233  290.475012  27.260922
2012-06-20   76.608544  11.89841  288.467038  27.465157
2012-06-21   75.553077  11.60821  282.323161  26.763653
2012-06-22   76.132474  11.80168  285.455033  27.260922
2012-06-25   74.650634  11.55500  280.070407  26.523901
2012-06-26   74.815429  11.53565  282.058429  26.657097
2012-06-27   75.138474  11.92743  284.366112  26.790293
2012-06-28   74.425671  11.55984  281.873596  26.559419
2012-06-29   76.380976  12.10155  289.745749  27.163244
2012-07-02   77.495299  11.98064  289.945546  27.136604
...                ...       ...         ...        ...
2016-09-08  105.519997       NaN  775.320007  57.430000
2016-09-09  103.129997       NaN  759.659973  56.209999
2016-09-12  105.440002       NaN  769.020020  57.049999
2016-09-13  107.949997       NaN  759.690002  56.529999
2016-09-14  111.769997       NaN  762.489990  56.259998
2016-09-15  115.570000       NaN  771.760010  57.189999
2016-09-16  114.919998       NaN  768.880005  57.250000
2016-09-19  113.580002       NaN  765.700012  56.930000
2016-09-20  113.570000       NaN  771.409973  56.810001
2016-09-21  113.550003       NaN  776.219971  57.759998
2016-09-22  114.620003       NaN  787.210022  57.820000
2016-09-23  112.709999       NaN  786.900024  57.430000
2016-09-26  112.879997       NaN  774.210022  56.900002
2016-09-27  113.089996       NaN  783.010010  57.950001
2016-09-28  113.949997       NaN  781.559998  58.029999
2016-09-29  112.180000       NaN  775.010010  57.400002
2016-09-30  113.050003       NaN  777.289978  57.599998
2016-10-03  112.519997       NaN  772.559998  57.419998
2016-10-04  113.000000       NaN  776.429993  57.240002
2016-10-05  113.050003       NaN  776.469971  57.639999
2016-10-06  113.889999       NaN  776.859985  57.740002
2016-10-07  114.059998       NaN  775.080017  57.799999
2016-10-10  116.050003       NaN  785.940002  58.040001
2016-10-11  116.300003       NaN  783.070007  57.189999
2016-10-12  117.339996       NaN  786.140015  57.110001
2016-10-13  116.980003       NaN  778.190002  56.919998
2016-10-14  117.629997       NaN  778.530029  57.419998
2016-10-17  117.550003       NaN  779.960022  57.220001
2016-10-18  117.470001       NaN  795.260010  57.660000
2016-10-19  117.120003       NaN  801.500000  57.529999

[1125 rows x 4 columns]

In [224]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
...                      ...         ...         ...         ...        ...
2016-10-06 AAPL   113.699997  114.339996  113.129997  113.889999   28779300
           GOOG   779.000000  780.479980  775.539978  776.859985    1066300
           MSFT    57.740002   57.860001   57.279999   57.740002   16212600
2016-10-07 AAPL   114.309998  114.559998  113.510002  114.059998   24358400
           GOOG   779.659973  779.659973  770.750000  775.080017     930700
           MSFT    57.849998   57.980000   57.419998   57.799999   20089000
2016-10-10 AAPL   115.019997  116.750000  114.720001  116.050003   36236000
           GOOG   777.710022  789.380005  775.869995  785.940002    1161400
           MSFT    57.910000   58.389999   57.869999   58.040001   18196500
2016-10-11 AAPL   117.699997  118.690002  116.199997  116.300003   64041000
           GOOG   786.659973  792.280029  780.580017  783.070007    1368000
           MSFT    57.889999   58.020000   56.889999   57.189999   26497400
2016-10-12 AAPL   117.349998  117.980003  116.750000  117.339996   37586800
           GOOG   783.760010  788.130005  782.059998  786.140015     934900
           MSFT    57.110001   57.270000   56.400002   57.110001   22177500
2016-10-13 AAPL   116.790001  117.440002  115.720001  116.980003   35192400
           GOOG   781.219971  781.219971  773.000000  778.190002    1300400
           MSFT    56.700001   57.299999   56.320000   56.919998   25313700
2016-10-14 AAPL   117.879997  118.169998  117.129997  117.629997   35652200
           GOOG   781.650024  783.950012  776.000000  778.530029     851100
           MSFT    57.119999   57.740002   57.119999   57.419998   27402500
2016-10-17 AAPL   117.330002  117.839996  116.779999  117.550003   23624900
           GOOG   779.799988  785.849976  777.500000  779.960022    1089500
           MSFT    57.360001   57.459999   56.869999   57.220001   23830000
2016-10-18 AAPL   118.180000  118.209999  117.449997  117.470001   24553500
           GOOG   787.849976  801.609985  785.565002  795.260010    1995600
           MSFT    57.529999   57.950001   57.410000   57.660000   19149500
2016-10-19 AAPL   117.250000  117.760002  113.800003  117.120003   19925700
           GOOG   798.239990  804.599976  798.030029  801.500000     116600
           MSFT    57.470001   57.840000   57.400002   57.529999   22830800

                   Adj Close
Date       minor
2012-05-30 AAPL    75.749262
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.053272
2012-05-31 AAPL    75.560928
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.920075
2012-06-01 AAPL    73.371509
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.262972
2012-06-04 AAPL    73.803114
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.351768
2012-06-05 AAPL    73.612167
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.316250
2012-06-06 AAPL    74.740879
           DELL    11.816190
           GOOG   289.995487
           MSFT    26.062152
2012-06-07 AAPL    74.774881
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.955594
2012-06-08 AAPL    75.899667
           DELL    11.724290
...                      ...
2016-10-06 AAPL   113.889999
           GOOG   776.859985
           MSFT    57.740002
2016-10-07 AAPL   114.059998
           GOOG   775.080017
           MSFT    57.799999
2016-10-10 AAPL   116.050003
           GOOG   785.940002
           MSFT    58.040001
2016-10-11 AAPL   116.300003
           GOOG   783.070007
           MSFT    57.189999
2016-10-12 AAPL   117.339996
           GOOG   786.140015
           MSFT    57.110001
2016-10-13 AAPL   116.980003
           GOOG   778.190002
           MSFT    56.919998
2016-10-14 AAPL   117.629997
           GOOG   778.530029
           MSFT    57.419998
2016-10-17 AAPL   117.550003
           GOOG   779.960022
           MSFT    57.220001
2016-10-18 AAPL   117.470001
           GOOG   795.260010
           MSFT    57.660000
2016-10-19 AAPL   117.120003
           GOOG   801.500000
           MSFT    57.529999

[3688 rows x 6 columns]

In [225]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1119 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2016-10-19 00:00:00
Minor_axis axis: AAPL to MSFT